c5/src/Catalogs/Contracts/Contracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Organizations</owners>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesMonthly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerRateType</name>
    <type>
      <types>EnumRef.CurrencyRates</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerVATAdvance</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Export</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Import</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Signed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>DocumentRef.Document</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesMonthly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorRateType</name>
    <type>
      <types>EnumRef.CurrencyRates</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorItems</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorServices</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/PaymentsTable/Module.bsl
&AtServer
Procedure Fill ( Object ) export
	
	table = getPayments ( Object );
	if ( table.Count () = 0 ) then
		return;
	endif; 
	Object.Payments.Load ( table );
	PaymentsTable.Calc ( Object );
	
EndProcedure
 
&AtServer
Function getPayments ( Object )
	
	type = TypeOf ( Object.Ref );
	s = "
	|select Payments.Option as Option, Payments.Variant as Variant, Payments.Percent as Percent,
	|	case when Payments.Variant = value ( Enum.PaymentVariants.Prepayment ) then &Date else null end as PaymentDate
	|from Catalog.Terms.Payments as Payments
	|where Payments.Ref in ( select ";
	if ( type = Type ( "DocumentRef.Invoice" )
		or type = Type ( "DocumentRef.Quote" )
		or type = Type ( "DocumentRef.SalesOrder" ) ) then
		s = s + "CustomerTerms";
	else
		s = s + "VendorTerms";
	endif; 
	s = s + " from Catalog.Contracts where Ref = &Contract )
	|order by Payments.LineNumber
	|";
	q = new Query ( s );
	q.SetParameter ( "Contract", Object.Contract );
	q.SetParameter ( "Date", BegOfDay ( Periods.GetDocumentDate ( Object ) ) );
	table = q.Execute ().Unload ();
	return table;
	
EndFunction

Procedure Calc ( Object ) export
	
	Collections.Distribute ( Object.Amount, Object.Payments, "Percent", "Amount" );
	
EndProcedure

&AtClient
Procedure Fix ( Object ) export
	
	amount = Object.Payments.Total ( "Amount" );
	if ( amount <> Object.Amount ) then
		Calc ( Object );
	endif; 
	
EndProcedure

&AtServer
Function Check ( Object ) export
	
	if ( tableIsEmpty ( Object ) ) then
		return false;
	endif; 
	if ( dateDoubled ( Object ) ) then
		return false;
	endif; 
	if ( incorrectPeriod ( Object ) ) then
		return false;
	endif; 
	return true;
	
EndFunction

&AtServer
Function tableIsEmpty ( Object )
	
	meta = Object.Ref.Metadata ();
	p = new Structure ();
	p.Insert ( "Table", meta.TabularSections.Payments.Presentation () );
	if ( Object.Amount > 0 and Object.Payments.Count () = 0 ) then
		Output.TableIsEmpty ( p, "Payments" );
		return true;
	endif; 
	return false;
	
EndFunction
 
&AtServer
Function dateDoubled ( Object )
	
	meta = Object.Ref.Metadata ();
	p = new Structure ( "Table, Values" );
	p.Table = meta.TabularSections.Payments.Presentation ();;
	doubleRows = CollectionsSrv.GetDuplicates ( Object.Payments, "Option, PaymentDate" );
	if ( doubleRows <> undefined ) then
		for each row in doubleRows do
			p.Values = "" + row.Option + ", " + row.PaymentDate;
			Output.TableDoubleRows ( p, "Payments" );
		enddo; 
		return true;
	endif;
	return false;
	
EndFunction

&AtServer
Function incorrectPeriod ( Object )
	
	error = false;
	startDate = BegOfDay ( Periods.GetDocumentDate ( Object ) );
	for each row in Object.Payments do
		if ( not Periods.Ok ( startDate, row.PaymentDate ) ) then
			Output.PaymentDateError ( , Output.Row ( "Payments", row.LineNumber, "PaymentDate" ) );
			error = true;
		endif; 
	enddo; 
	return error;
	
EndFunction

&AtServer
Function CheckQuote ( Object ) export
	
	if ( dateDoubled ( Object ) ) then
		return false;
	endif; 
	if ( incorrectPeriod ( Object ) ) then
		return false;
	endif; 
	return true;
	
EndFunction
